/*请编写程序，找出斐波那契数列中数值不超过 4 百万的项，并计算这些项中值为偶数的项之和
斐波那契数列中，从第三项开始，每一项被定义为前两项的数字之和
从 1 和 2 开始，斐波那契数列的前 10 项应该是这样：1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ....*/

#include<stdio.h>

int main()
{
        long a = 0 , b  = 1 , next, sum = 0 ;

        while(a <= 4000000)
        {
            printf("分别是%ld\n",a);
            if((a % 2) == 0)
            {
                sum += a ;
            }
            next = a + b;
            a = b;
            b = next;
        }

        printf("其中，偶数项的和为%ld\n",sum);

        return 0;
}

//想了2小时，还得是chatGPT帮忙。。。
//for来for去，原来这么简单的方法啊啊啊啊
//嗯，后半段求和是自己做出来滴~~